# -*- coding: utf-8 -*-
GREETING = u"Привет, %s! \u270b \nДавай знакомиться? Я — Зайка\U0001F430Помогайка, " \
           u"призван помочь тебе с ежедневными отчётами! \U0001F600 " \
           u"\nОтправь мне свой номер телефона \U0001F4F1 для того, чтобы авторизоваться \U0001F447"
SEND_PHONE = u"\U0001F4F1 Отправить номер"
TYPE_PHONE = u"\u26A0 Твой телефон не найден в базе сотрудников. " \
             u"Пожалуйста, введи его вручную в формате 375291111111"
TYPE_PHONE_AGAIN = u"\u26A0 Телефон не найден, попробуй еще раз"
PHONE_FOUND = u"Твой телефон был найден в базе, теперь введи пароль \U0001F447"
PASSWORD_INCORRECT = u"\u26A0 Неверный пароль"
PASSWORD_CORRECT = u"\u2705 Пароль верный"
PASSWORD_WAS_CHANGED = u"\u26A0 Пароль в системе был изменен. Введите пароль заново \U0001F447"
WHAT_DO_WE_DO = u"Чем займёмся? \U0001F609 \nМожешь воспользоваться меню ниже\U0001F447"
STAFF_LIST = u"\U0001F50E К твоему телефону привязано несколько сотрудников, " \
             u"выбери того, под кем ты сейчас хочешь работать \U0001F447"
AUTHORIZED = u"Готово! Ты успешно авторизована под именем %s! \U0001F64C" \
             u"\nТеперь ты можешь воспользоваться меню ниже \U0001F447"
AUTHORIZED_CALLBACK_ANSWER = u"\u2705 Авторизованы"
MY_RECORDS = u"\U0001F4C5 Мои записи на сегодня"
LOGOUT = u"\U0001F6D1 Завершить сеанс %s"
ALREADY_AUTHORIZED = u"Ты уже авторизована \U0001F44C" \
                     u"\nЕсли хочешь сменить сотрудника, воспользуйся меню ниже \U0001F447"
LOGOUT_SUCCESS = u"Сеанс %s завершён \U0001F44C" \
                 u"\nТы можешь авторизоваться под другим именем, " \
                 u"воспользовавшись меню ниже"
STAFF_LIST_MENU = u"\U0001F4CB Список сотрудников"
SEEMS_RECORD_DELETED = u"\u26A0 Похоже такой записи больше не существует"
NO_RECORDS_TODAY = u"Нет записей на сегодня \U0001F914"
SEND_REPORT = u"Отправить отчет \U0001F4DD"
REPORT_WAS_SEND = u"\u2705 Отчет отправлен"
REPORT_NOT_SEND = u"\u274C Отчет не отправлен"
SOMETHING_WENT_WRONG = u"\u26A0 Похоже что-то пошло не так, попробуй повторить попытку чуть позже"
CLIENT_CAME = u"Пришёл \u2705"
CLIENT_NOT_CAME = u"Не пришёл \u274C"
EDIT_REPORT = u"Изменить отчет \u270F"
VISIT_FINISHED = u"\u2705 Оплачено"
VISIT_NOT_CAME = u"\u274C Клиент не пришёл"
ACCEPTED = u"\u2705 Принято"
SEND_PHOTO = u"Пришли мне фото сделанной работы \U0001F5BC"
CANCEL_OPERATION = u"\u274c Отменить операцию"
ERROR_DURING_PHOTO_ADD = u"Возникла ошибка при добавлении фото \u26A0" \
                         u"Убедись в том, что присылаешь фотографию как «Фото», а не как «Файл»"
SELECT_SERVICE = u"*Выбери услугу* \U0001F4CC"
SELECT_ADDITIONAL_SERVICE = u"*Укажи дополнительные опции сделанной услуги* \u2795"
MAIN_SERVICE_ADDED = u"\u2705 Услуга добавлена"
MAIN_SERVICE_CHANGED = u"\u2705 Услуга изменена"
ADDITIONAL_SERVICE_ADDED = u"\u2795 Доп. услуга добавлена"
ADDITIONAL_SERVICE_REMOVED = u"\u2795 Доп. услуга удалена"
TOTAL_COST = u"\U0001F4B0 Итого 0 BYN"
REPORT_DONE = u"Отправить отчет \U0001F4EC"
DONE = u"Готово \u2705"
PUSH_THE_BUTTON = u"\U0001F4A1 *Если считаешь, что отчет готов - жми эту кнопку:*"
SELECT_SERVICES = u"Выбери оказанные услуги \U0001F447"
ADD_PHOTO = u"\U0001F5BC *Добавить фото сделанной работы:*"
ADD_PHOTO_BUTTON = u"\U0001F5BC Добавить фото"
LEAVE_COMMENT = u"\U0001F4AC *При необходимости насписать комментарий, нажми эту кнопку:*"
LEAVE_COMMENT_BUT = u"\U0001F4AC Оставить комментарий"
LEAVE_COMMENT_BELOW = u"Напишите комментарий ниже и пришли мне его \U0001F447"
COMMENT_SAVED = u"Комментарий сохранен \U0001F44C Жми кнопку %s если закончила с заполнением отчета" % DONE
NO = "Нет"
YOUR_REPORT = u"*Итак, вот твой отчет \U0001F447*"
REPORT_RESULTS = u"Дата: %s\n\n" \
                 u"Время визита: %s\n\n" \
                 u"Клиент: %s\n\n" \
                 u"Основная услуга: %s\n\n" \
                 u"Дополнительные услуги:\n %s\n\n" \
                 u"Комментарий: %s\n\n" \
                 u"Итого BYN: %s\n\n\n" \
                 u"Если отчет верный, то жми кнопку Отправить \U0001F4E4, если отчет содержит ошибки, то ты можешь " \
                 u"отлистать вверх, внести необходимые изменения и нажать кнопку Готово \u2705." \
                 u"Чтобы изменить фото выполненной работы жми кнопку Изменить фото \U0001F5BC"
REPORT_RESULTS_CHANNEL = u"Мастер: %s\n" \
                         u"Фото работы: %s\n" \
                         u"Дата: %s\n" \
                         u"Время визита: %s\n" \
                         u"Клиент: %s\n" \
                         u"Основная услуга: %s\n" \
                         u"Дополнительные услуги:\n%s\n" \
                         u"Комментарий: %s\n" \
                         u"Итого BYN: %s"
SEND_DONE_REPORT = u"Отправить \U0001F4E4"
CHANGE_PHOTO = u"Изменить фото \U0001F5BC"
CHANGE_PHOTO_EDIT = u"\U0001F5BC *При необходимости изменить фото, нажми эту кнопку:*"
CHANGE_PHOTO_BUT = u"\U0001F5BC Изменить фото"
PHOTO_CHANGED = u"Фото успешно добавлено \U0001F44C Жми кнопку %s если закончила с заполнением отчета" % DONE
PHOTO_OF_SERVICE = "Фото выполненной работы"
ERROR_REPORT_PHOTO = u"\u26A0 Не добавлено фото выполненной работы"
ERROR_REPORT_RESULTS = u"\u26A0 Похоже, что ты не выбрала основную или доп. услугу " \
                       u"(в отчете должно присутствовать хотя бы что-нибудь одно из этого)"
REPORT_AFTER_SEND_INFO = u"Отчет успешно отправлен, ты всё еще можешь его изменить до того момента, пока он не будет" \
                         u" оплачен. Для этого перейди в список своих записей на сегодня и нажми %s" % EDIT_REPORT
VISIT_ALREADY_PAID = u"\u26A0 Данный визит уже оплачен, поэтому изменять отчёты по нему больше нет возможности"
FIRST_NEED_LOGIN = u"\u26A0 Для начала необходимо авторизоваться, выбрав себя в списке сотрудников. \n" \
                   u"Используй меню ниже, или команду /staff_list чтобы вывести " \
                   u"список сотрудников и найти там себя \U0001F447"
UPLOADING_PHOTO = "Идёт загрузка фото..."